### 📦 Plan for `sbx/eu-west-1/ecr`
```hcl
05:31:42.272 STDOUT terraform: Terraform used the selected providers to generate the following execution
05:31:42.272 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
05:31:42.272 STDOUT terraform:   + create
05:31:42.272 STDOUT terraform: Terraform will perform the following actions:
05:31:42.272 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-a"] will be created
05:31:42.272 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
05:31:42.272 STDOUT terraform:       + id          = (known after apply)
05:31:42.272 STDOUT terraform:       + policy      = jsonencode(
05:31:42.272 STDOUT terraform:             {
05:31:42.272 STDOUT terraform:               + rules = [
05:31:42.272 STDOUT terraform:                   + {
05:31:42.272 STDOUT terraform:                       + action       = {
05:31:42.272 STDOUT terraform:                           + type = "expire"
05:31:42.272 STDOUT terraform:                         }
05:31:42.272 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
05:31:42.272 STDOUT terraform:                       + rulePriority = 1
05:31:42.272 STDOUT terraform:                       + selection    = {
05:31:42.273 STDOUT terraform:                           + countNumber = 3
05:31:42.273 STDOUT terraform:                           + countType   = "sinceImagePushed"
05:31:42.273 STDOUT terraform:                           + countUnit   = "days"
05:31:42.273 STDOUT terraform:                           + tagStatus   = "untagged"
05:31:42.273 STDOUT terraform:                         }
05:31:42.273 STDOUT terraform:                     },
05:31:42.273 STDOUT terraform:                   + {
05:31:42.273 STDOUT terraform:                       + action       = {
05:31:42.273 STDOUT terraform:                           + type = "expire"
05:31:42.273 STDOUT terraform:                         }
05:31:42.273 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
05:31:42.273 STDOUT terraform:                       + rulePriority = 2
05:31:42.273 STDOUT terraform:                       + selection    = {
05:31:42.273 STDOUT terraform:                           + countNumber    = 7
05:31:42.273 STDOUT terraform:                           + countType      = "imageCountMoreThan"
05:31:42.273 STDOUT terraform:                           + tagPatternList = [
05:31:42.273 STDOUT terraform:                               + "*pull_request*",
05:31:42.273 STDOUT terraform:                             ]
05:31:42.273 STDOUT terraform:                           + tagStatus      = "tagged"
05:31:42.273 STDOUT terraform:                         }
05:31:42.273 STDOUT terraform:                     },
05:31:42.273 STDOUT terraform:                   + {
05:31:42.273 STDOUT terraform:                       + action       = {
05:31:42.273 STDOUT terraform:                           + type = "expire"
05:31:42.273 STDOUT terraform:                         }
05:31:42.273 STDOUT terraform:                       + description  = "Expire images older than 50 days."
05:31:42.273 STDOUT terraform:                       + rulePriority = 3
05:31:42.274 STDOUT terraform:                       + selection    = {
05:31:42.274 STDOUT terraform:                           + countNumber = 50
05:31:42.274 STDOUT terraform:                           + countType   = "imageCountMoreThan"
05:31:42.274 STDOUT terraform:                           + tagStatus   = "any"
05:31:42.274 STDOUT terraform:                         }
05:31:42.274 STDOUT terraform:                     },
05:31:42.274 STDOUT terraform:                 ]
05:31:42.274 STDOUT terraform:             }
05:31:42.274 STDOUT terraform:         )
05:31:42.274 STDOUT terraform:       + registry_id = (known after apply)
05:31:42.274 STDOUT terraform:       + repository  = "microservice-a"
05:31:42.274 STDOUT terraform:     }
05:31:42.274 STDOUT terraform:   # aws_ecr_lifecycle_policy.default_policy["microservice-b"] will be created
05:31:42.274 STDOUT terraform:   + resource "aws_ecr_lifecycle_policy" "default_policy" {
05:31:42.274 STDOUT terraform:       + id          = (known after apply)
05:31:42.274 STDOUT terraform:       + policy      = jsonencode(
05:31:42.274 STDOUT terraform:             {
05:31:42.274 STDOUT terraform:               + rules = [
05:31:42.274 STDOUT terraform:                   + {
05:31:42.274 STDOUT terraform:                       + action       = {
05:31:42.274 STDOUT terraform:                           + type = "expire"
05:31:42.274 STDOUT terraform:                         }
05:31:42.274 STDOUT terraform:                       + description  = "Remove untagged images after 3 days."
05:31:42.274 STDOUT terraform:                       + rulePriority = 1
05:31:42.274 STDOUT terraform:                       + selection    = {
05:31:42.274 STDOUT terraform:                           + countNumber = 3
05:31:42.274 STDOUT terraform:                           + countType   = "sinceImagePushed"
05:31:42.274 STDOUT terraform:                           + countUnit   = "days"
05:31:42.274 STDOUT terraform:                           + tagStatus   = "untagged"
05:31:42.274 STDOUT terraform:                         }
05:31:42.275 STDOUT terraform:                     },
05:31:42.275 STDOUT terraform:                   + {
05:31:42.275 STDOUT terraform:                       + action       = {
05:31:42.275 STDOUT terraform:                           + type = "expire"
05:31:42.275 STDOUT terraform:                         }
05:31:42.275 STDOUT terraform:                       + description  = "Remove images created by pull-requests older than 7 days."
05:31:42.275 STDOUT terraform:                       + rulePriority = 2
05:31:42.275 STDOUT terraform:                       + selection    = {
05:31:42.275 STDOUT terraform:                           + countNumber    = 7
05:31:42.275 STDOUT terraform:                           + countType      = "imageCountMoreThan"
05:31:42.275 STDOUT terraform:                           + tagPatternList = [
05:31:42.275 STDOUT terraform:                               + "*pull_request*",
05:31:42.275 STDOUT terraform:                             ]
05:31:42.275 STDOUT terraform:                           + tagStatus      = "tagged"
05:31:42.275 STDOUT terraform:                         }
05:31:42.275 STDOUT terraform:                     },
05:31:42.275 STDOUT terraform:                   + {
05:31:42.275 STDOUT terraform:                       + action       = {
05:31:42.275 STDOUT terraform:                           + type = "expire"
05:31:42.275 STDOUT terraform:                         }
05:31:42.275 STDOUT terraform:                       + description  = "Expire images older than 50 days."
05:31:42.275 STDOUT terraform:                       + rulePriority = 3
05:31:42.275 STDOUT terraform:                       + selection    = {
05:31:42.275 STDOUT terraform:                           + countNumber = 50
05:31:42.275 STDOUT terraform:                           + countType   = "imageCountMoreThan"
05:31:42.275 STDOUT terraform:                           + tagStatus   = "any"
05:31:42.275 STDOUT terraform:                         }
05:31:42.275 STDOUT terraform:                     },
05:31:42.275 STDOUT terraform:                 ]
05:31:42.275 STDOUT terraform:             }
05:31:42.275 STDOUT terraform:         )
05:31:42.276 STDOUT terraform:       + registry_id = (known after apply)
05:31:42.276 STDOUT terraform:       + repository  = "microservice-b"
05:31:42.276 STDOUT terraform:     }
05:31:42.276 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-a"] will be created
05:31:42.276 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
05:31:42.276 STDOUT terraform:       + arn                  = (known after apply)
05:31:42.276 STDOUT terraform:       + id                   = (known after apply)
05:31:42.276 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
05:31:42.276 STDOUT terraform:       + name                 = "microservice-a"
05:31:42.276 STDOUT terraform:       + registry_id          = (known after apply)
05:31:42.276 STDOUT terraform:       + repository_url       = (known after apply)
05:31:42.276 STDOUT terraform:       + tags                 = {
05:31:42.276 STDOUT terraform:           + "Environment" = "dev"
05:31:42.276 STDOUT terraform:           + "Terragrunt"  = "true"
05:31:42.276 STDOUT terraform:         }
05:31:42.276 STDOUT terraform:       + tags_all             = {
05:31:42.276 STDOUT terraform:           + "Data-classification" = "internal"
05:31:42.276 STDOUT terraform:           + "Environment"         = "dev"
05:31:42.276 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:31:42.276 STDOUT terraform:           + "Organization"        = "genopsx"
05:31:42.276 STDOUT terraform:           + "Terragrunt"          = "true"
05:31:42.276 STDOUT terraform:         }
05:31:42.276 STDOUT terraform:       + image_scanning_configuration {
05:31:42.276 STDOUT terraform:           + scan_on_push = true
05:31:42.276 STDOUT terraform:         }
05:31:42.276 STDOUT terraform:     }
05:31:42.276 STDOUT terraform:   # aws_ecr_repository.ecr_repository["microservice-b"] will be created
05:31:42.276 STDOUT terraform:   + resource "aws_ecr_repository" "ecr_repository" {
05:31:42.276 STDOUT terraform:       + arn                  = (known after apply)
05:31:42.276 STDOUT terraform:       + id                   = (known after apply)
05:31:42.276 STDOUT terraform:       + image_tag_mutability = "MUTABLE"
05:31:42.276 STDOUT terraform:       + name                 = "microservice-b"
05:31:42.276 STDOUT terraform:       + registry_id          = (known after apply)
05:31:42.276 STDOUT terraform:       + repository_url       = (known after apply)
05:31:42.276 STDOUT terraform:       + tags                 = {
05:31:42.276 STDOUT terraform:           + "Environment" = "dev"
05:31:42.276 STDOUT terraform:           + "Terragrunt"  = "true"
05:31:42.276 STDOUT terraform:         }
05:31:42.276 STDOUT terraform:       + tags_all             = {
05:31:42.276 STDOUT terraform:           + "Data-classification" = "internal"
05:31:42.276 STDOUT terraform:           + "Environment"         = "dev"
05:31:42.276 STDOUT terraform:           + "Managed-by"          = "terragrunt"
05:31:42.276 STDOUT terraform:           + "Organization"        = "genopsx"
05:31:42.276 STDOUT terraform:           + "Terragrunt"          = "true"
05:31:42.276 STDOUT terraform:         }
05:31:42.276 STDOUT terraform:       + image_scanning_configuration {
05:31:42.276 STDOUT terraform:           + scan_on_push = true
05:31:42.276 STDOUT terraform:         }
05:31:42.276 STDOUT terraform:     }
05:31:42.276 STDOUT terraform: Plan: 4 to add, 0 to change, 0 to destroy.
05:31:42.276 STDOUT terraform: Changes to Outputs:
05:31:42.276 STDOUT terraform:   + repositories_arns = {
05:31:42.276 STDOUT terraform:       + microservice-a = (known after apply)
05:31:42.276 STDOUT terraform:       + microservice-b = (known after apply)
05:31:42.276 STDOUT terraform:     }
05:31:42.276 STDOUT terraform:   + repositories_urls = {
05:31:42.276 STDOUT terraform:       + microservice-a = (known after apply)
05:31:42.276 STDOUT terraform:       + microservice-b = (known after apply)
05:31:42.276 STDOUT terraform:     }
```
